{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите целое число: 3972\n",
      "9\n",
      "Введите первое значение: 33\n",
      "Введите второе значение: 5\n",
      "Второе значение = 5\n",
      "Первое значение = 33\n",
      "----------\n",
      "Дано квадратное уравнение: ax**2 + bx + c\n",
      "Введите a: 8\n",
      "Введите b: 12\n",
      "Введите c: 3\n",
      "Корни уравнения:\n",
      " x1 =  -1.2679491924311228 \n",
      " x2 =  -4.732050807568877\n"
     ]
    }
   ],
   "source": [
    "\n",
    "__author__ = 'Ксения Хисамутдинова'\n",
    "\n",
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "# Подсказки:\n",
    "# * постарайтесь решить задачу с применением арифметики и цикла while;\n",
    "# * при желании и понимании решите задачу с применением цикла for.\n",
    "\n",
    "N = 0\n",
    "num = input('Введите целое число: ')\n",
    "for i in num:\n",
    "    if (int(i)) > N:\n",
    "        N = int(i)\n",
    "print(N)\n",
    "\n",
    "\n",
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Подсказки:\n",
    "# * постарайтесь сделать решение через действия над числами;\n",
    "# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.\n",
    "\n",
    "a = int(input('Введите первое значение: '))\n",
    "b = int(input('Введите второе значение: '))\n",
    " \n",
    "a = a + b\n",
    "b = a - b\n",
    "a = a - b\n",
    " \n",
    "print('Второе значение =', a)\n",
    "print('Первое значение =', b)\n",
    "print('----------')\n",
    "\n",
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax² + bx + c = 0.\n",
    "# Коэффициенты уравнения вводятся пользователем.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "\n",
    "import math\n",
    "print('Дано квадратное уравнение: ax**2 + bx + c')\n",
    "a = float(input('Введите a: '))\n",
    "b = float(input('Введите b: '))\n",
    "c = float(input('Введите c: '))\n",
    "D = b**2 - 4*a*c\n",
    "if D > 0:\n",
    "    x1 = (-b + math.sqrt(D)) / a*2\n",
    "    x2 = (-b - math.sqrt(D)) / a*2\n",
    "    print('Корни уравнения:\\n', 'x1 = ', x1, '\\n x2 = ', x2)\n",
    "elif D == 0:\n",
    "    print('Корень уравнения: ', x1)\n",
    "else:\n",
    "    print('Нет корней')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
